<?php
// Copyright 1999-2018. Plesk International GmbH.
$messages = [
  'apply' => [
    'action' => 'هل تود التواصل مع <strong>%%providerName%%</strong> وتغيير تكوين DNS للنطاق الخاص بك؟',
    'cancelButton' => 'إلغاء',
    'connectButton' => 'اتصال',
    'description' => 'الاتصال <strong>%%domain%%</strong> مع <strong>%%providerName%%</strong> سيؤدي إلى تغيير تكوين DNS الحالي.',
    'hideDetails' => 'إخفاء التفاصيل',
    'nothingToAdd' => 'لا توجد سجلات DNS لإضافتها. الخدمة متصلة بالفعل.',
    'showDetails' => 'إظهار التفاصيل',
    'success' => 'تم تطبيق التغييرات على %%domain%%.',
    'toAdd' => 'ستتم إضافة سجلات DNS التالية:',
    'toRemove' => 'سيتم حذف سجلات DNS التالية:',
  ],
  'description' => 'إن شراء اسم نطاق يمثل مجرد بداية الرحلة. ولكي يتسنى وضع موقع الويب الخاص بك على الإنترنت، يلزم عليك إقرانه بنطاقك. إذا كنت قد قمت بشراء اسم نطاق من مسجّل ما واستضيف موقعك على الويب لدى مزود استضافة آخر، فقد تحتاج إلى توجيه اسم النطاق إلى خادم نظام Plesk الأساسي الخاص بك. وإذا كان اسم نطاقك موجهًا بالفعل إلى منصة Plesk، فقد ترغب في إضافة خدمات طرف ثالث إضافية (على سبيل المثال، النظام الأساسي للبريد أو التجارة الإلكترونية) إلى موقعك على الويب. وفي كلتا الحالتين، سيلزم عليك تكوين إعدادات DNS. قد تكون هذه المهمة مهمة صعبة، خاصة للمبتدئين. ولإنجاز هذه المهمة بسهولة، استخدم ملحق Domain Connect. ما عليك سوى تقديم اسم النطاق، وسيقوم الملحق تلقائيًا بتكوين إعدادات DNS لك.',
  'exceptions' => [
    'clientHasNotAccessToDomain' => 'لا يمكن الوصول إلى النطاق.',
    'dnsProviderDisabled' => 'تم تعطيل مقدم خدمة DNS من خلال تكوين الخادم.',
    'postRequestRequired' => 'يلزم توافر طلب POST.',
  ],
  'message.connect' => 'هل تريد اتصال <strong>%%domain%%</strong> بنظام Plesk الأساسي تلقائيًا؟ %%link%%.',
  'message.link' => 'الاتصال باستخدام ملحق Domain Connect',
  'title' => 'ملحق Domain Connect',
];