<?php
// Copyright 1999-2018. Plesk International GmbH.
$messages = [
  'apply' => [
    'action' => 'Θέλετε να συνδεθείτε στο <strong>%%providerName%%</strong> και να αλλάξετε τις ρυθμίσεις παραμέτρων DNS για τον τομέα σας;',
    'cancelButton' => 'Ακύρωση',
    'connectButton' => 'Σύνδεση',
    'description' => 'Εάν συνδέσετε τον τομέα <strong>%%domain%%</strong> στο <strong>%%providerName%%</strong>, θα αλλάξουν οι τρέχουσες ρυθμίσεις παραμέτρων DNS.',
    'hideDetails' => 'Απόκρυψη λεπτομερειών',
    'nothingToAdd' => 'Δεν υπάρχουν εγγραφές DNS για προσθήκη.Η υπηρεσία έχει συνδεθεί ήδη.',
    'showDetails' => 'Εμφάνιση λεπτομερειών',
    'success' => 'Οι αλλαγές εφαρμόστηκαν στο %%domain%%.',
    'toAdd' => 'Οι ακόλουθες εγγραφές DNS θα προστεθούν:',
    'toRemove' => 'Οι ακόλουθες εγγραφές DNS θα καταργηθούν:',
  ],
  'description' => 'Η αγορά ενός ονόματος τομέα είναι μόνο η αρχή. Για να δημοσιευτεί η τοποθεσία σας στο διαδίκτυο, θα πρέπει να τη συσχετίσετε με τον τομέα σας. Εάν έχετε αγοράσει ένα όνομα τομέα από κάποιον καταχωρητή και φιλοξενείτε την τοποθεσία σας σε άλλο πάροχο υπηρεσιών φιλοξενίας, μπορεί να χρειαστεί να αντιστοιχίσετε το όνομα τομέα με τον διακομιστή Plesk σας.Εάν το όνομα τομέα σας είναι ήδη αντιστοιχισμένο με το Plesk, μπορεί να χρειαστεί να προσθέσετε επιπλέον υπηρεσίες τρίτων (π.χ. αλληλογραφία ή πλατφόρμα ηλεκτρονικού εμπορίου) στην τοποθεσία web σας. Και στις δύο αυτές περιπτώσεις, θα πρέπει να ρυθμίσετε τις παραμέτρους DNS.Αυτή η διαδικασία μπορεί να αποδειχθεί αρκετά δύσκολη, ειδικά για έναν αρχάριο.Για να ολοκληρώσετε εύκολα αυτή την ενέργεια, χρησιμοποιήστε την επέκταση Domain Connect. Απλά συμπληρώστε το όνομα τομέα σας και η επέκταση θα διαμορφώσει αυτόματα τις ρυθμίσεις DNS για εσάς.',
  'exceptions' => [
    'clientHasNotAccessToDomain' => 'Δεν υπάρχει πρόσβαση στον τομέα.',
    'dnsProviderDisabled' => 'Ο πάροχος DNS είναι απενεργοποιημένος στη ρύθμιση παραμέτρων του διακομιστή.',
    'postRequestRequired' => 'Απαιτείται αίτηση POST.',
  ],
  'message.connect' => 'Θέλετε να συνδέσετε τον τομέα <strong>%%domain%%</strong> στο Plesk αυτόματα;%%link%%.',
  'message.link' => 'Σύνδεση χρησιμοποιώντας το Domain Connect',
  'title' => 'Domain Connect',
];