<?php
// Copyright 1999-2018. Plesk International GmbH.
$messages = [
  'apply' => [
    'action' => 'เชื่อมต่อไปที่ <strong>%%providerName%%</strong> และเปลี่ยนการกำหนดค่า DNS ของโดเมนหรือไม่',
    'cancelButton' => 'ยกเลิก',
    'connectButton' => 'เชื่อมต่อ',
    'description' => 'การเชื่อมต่อ <strong>%%domain%%</strong> ไปที่ <strong>%%providerName%%</strong> จะเปลี่ยนการกำหนดค่า DNS ปัจจุบัน',
    'hideDetails' => 'ซ่อนรายละเอียด',
    'nothingToAdd' => 'ไม่มีระเบียน DNS ที่จะเพิ่ม เนื่องจากมีบริการเชื่อมต่อไว้อยู่แล้ว',
    'showDetails' => 'แสดงรายละเอียด',
    'success' => 'ทำการเปลี่ยนแปลง %%domain%% เรียบร้อยแล้ว',
    'toAdd' => 'จะทำการเพิ่มรายการ DNS ดังต่อไปนี้:',
    'toRemove' => 'จะทำการลบรายการ DNS ดังต่อไปนี้:',
  ],
  'description' => 'การซื้อชื่อโดเมนเป็นเพียงจุดเริ่มต้นของการเดินทาง ในการนำเว็บไซต์ของคุณขึ้นบนระบบออนไลน์ คุณจำเป็นต้องเชื่อมโยงเว็บไซต์เข้ากับโดเมนของคุณ หากคุณซื้อชื่อโดเมนจากนายทะเบียนและโฮสต์เว็บไซต์ของคุณจากผู้ให้บริการโฮสต์อื่น คุณอาจต้องนำทางชื่อโดเมนไปยังเซิร์ฟเวอร์ Plesk ของคุณ หากชื่อโดเมนของคุณนำทางไปที่ Plesk แล้ว คุณอาจต้องการเพิ่มบริการอื่นของบุคคลที่สาม (เช่น อีเมลหรือแพลตฟอร์มอีคอมเมิร์ซ) ลงในเว็บไซต์ของคุณ ซึ่งคุณจะต้องกำหนดการตั้งค่า DNS ในทั้งสองกรณี นี่อาจเป็นงานที่ท้าทายอยู่บ้างโดยเฉพาะอย่างยิ่งสำหรับผู้เริ่มต้น แต่คุณสามารถทำงานนี้ให้สำเร็จได้อย่างง่ายดายโดยใช้ส่วนขยาย Domain Connect แค่เพียงระบุชื่อโดเมน แล้วส่วนขยายจะกำหนดการตั้งค่า DNS ให้โดยอัตโนมัติ',
  'exceptions' => [
    'clientHasNotAccessToDomain' => 'ไม่มีสิทธิ์เข้าถึงโดเมน',
    'dnsProviderDisabled' => 'การกำหนดค่าเซิร์ฟเวอร์ปิดการใช้งานผู้ให้บริการ DNS ไว้',
    'postRequestRequired' => 'ซึ่งจำเป็นต้องมีคำขอ A POST',
  ],
  'message.connect' => 'คุณต้องการเชื่อมต่อ <strong>%%domain%%</strong> เข้ากับ Plesk โดยอัตโนมัติหรือไม่ %%link%%.',
  'message.link' => 'เชื่อมต่อโดยใช้ Domain Connect',
  'title' => 'Domain Connect',
];