<?php
// Copyright 1999-2018. Plesk International GmbH.
$messages = [
  'apply' => [
    'action' => 'Підключитися до <strong>%%providerName%%</strong> та змінити DNS налаштування для вашого домену?',
    'cancelButton' => 'Скасувати',
    'connectButton' => 'Підключитися',
    'description' => 'Підключення <strong>%%domain%%</strong> до <strong>%%providerName%%</strong> змінить поточні DNS налаштування.',
    'hideDetails' => 'Приховати детальну інформацію',
    'nothingToAdd' => 'DNS-записів не знайдено. Цей сервіс вже підключено.',
    'showDetails' => 'Показати детальну інформацію',
    'success' => 'Застосовано зміни для %%domain%%.',
    'toAdd' => 'Будуть додані наступні DNS-записи:',
    'toRemove' => 'Будуть видалені наступні DNS-записи:',
  ],
  'description' => 'Придбати ім’я домену — це лише початок шляху. Щоб розмістити веб-сайт у мережі, необхідно прив’язати його до свого домену. Якщо ви купили ім’я домену у реєстраторі та розмістили свій веб-сайт на сервері іншого хостинг-провайдеру, вам буде необхідно додати ім’я свого домену до серверу Plesk. Якщо ім’я домену вже додано в Plesk, вам може знадобитися встановити на веб-сайті додаткові сервіси третьої сторони (наприклад, пошту або платформу для електронної комерції). В будь-якому разі, вам доведеться сконфігурувати DNS налаштування. Це може виявитися складним завданням, особливо для початківців. Для вирішення цієї задачі вам стане у нагоді розширення Domain Connect. Все що необхідно зробити — зазначити ім’я домену, і розширення автоматично сконфігурує для нього DNS налаштування.',
  'exceptions' => [
    'clientHasNotAccessToDomain' => 'Доступ до домену відсутній.',
    'dnsProviderDisabled' => 'DNS-провайдер вимкнений конфігурацією сервера.',
    'postRequestRequired' => 'Потрібен POST-запит.',
  ],
  'message.connect' => 'Бажаєте підключити <strong>%%domain%%</strong> до Plesk автоматично? %%link%%.',
  'message.link' => 'Підключити з використанням Domain Connect',
  'title' => 'Domain Connect',
];